# dataframe

In [2]:
import pandas as pd

In [ ]:
l = [1,2,3,4,5,6]

var = pd.DataFrame(l)

print(var)

In [19]:

dicti = {"a": [2,3,5,7,9,11], "b":[4,8,6,11,19,9]}

var1 = pd.DataFrame(dicti)
print(var1)
var1 = pd.DataFrame(dicti, columns=['a'])
print(var1)

var1 = pd.DataFrame(dicti, columns=['a',], index=['a','b','c','d','e','f'])
print(var1)

print('\n', var1['a'][4])

    a   b
0   2   4
1   3   8
2   5   6
3   7  11
4   9  19
5  11   9
    a
0   2
1   3
2   5
3   7
4   9
5  11
    a
a   2
b   3
c   5
d   7
e   9
f  11

 9

C:\Users\Vipin\AppData\Local\Temp\ipykernel_6572\1126897499.py:11: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print('\n', var1['a'][4])

In [26]:
lists = [[1,2,3,4,5],[6,7,8,9,10]]

var2 = pd.DataFrame(lists)
print(var2)

print("\n")
frama = {"f":pd.Series([2,3,4,5,6]),"l":pd.Series([2,3,4,5,6]) }
var3 = pd.DataFrame(frama)
print(var3,"\n")
print(type(var))

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10


   f  l
0  2  2
1  3  3
2  4  4
3  5  5
4  6  6

<class 'pandas.core.frame.DataFrame'>

# Arithmetic operations

In [28]:


var = pd.DataFrame({"A":[1,2,3,4], "B":[5,6,7,8]})
var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [31]:
var['c']= var['A']+ var['B']
var

var['d']= var['A']* var['B']
var

   A  B   c   d
0  1  5   6   5
1  2  6   8  12
2  3  7  10  21
3  4  8  12  32

In [32]:
var['python']= var['B']>=7
var

   A  B   c   d  python
0  1  5   6   5   False
1  2  6   8  12   False
2  3  7  10  21    True
3  4  8  12  32    True